HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxPsi5_bf.h
/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD12 */
#define IFX_PSI5_CH_SORL_SD12_OFF (12)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD13 */
#define IFX_PSI5_CH_SORL_SD13_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD13 */
#define IFX_PSI5_CH_SORL_SD13_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD13 */
#define IFX_PSI5_CH_SORL_SD13_OFF (13)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD14 */
#define IFX_PSI5_CH_SORL_SD14_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD14 */
#define IFX_PSI5_CH_SORL_SD14_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD14 */
#define IFX_PSI5_CH_SORL_SD14_OFF (14)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD15 */
#define IFX_PSI5_CH_SORL_SD15_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD15 */
#define IFX_PSI5_CH_SORL_SD15_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD15 */
#define IFX_PSI5_CH_SORL_SD15_OFF (15)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD16 */
#define IFX_PSI5_CH_SORL_SD16_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD16 */
#define IFX_PSI5_CH_SORL_SD16_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD16 */
#define IFX_PSI5_CH_SORL_SD16_OFF (16)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD17 */
#define IFX_PSI5_CH_SORL_SD17_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD17 */
#define IFX_PSI5_CH_SORL_SD17_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD17 */
#define IFX_PSI5_CH_SORL_SD17_OFF (17)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD18 */
#define IFX_PSI5_CH_SORL_SD18_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD18 */
#define IFX_PSI5_CH_SORL_SD18_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD18 */
#define IFX_PSI5_CH_SORL_SD18_OFF (18)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD19 */
#define IFX_PSI5_CH_SORL_SD19_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD19 */
#define IFX_PSI5_CH_SORL_SD19_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD19 */
#define IFX_PSI5_CH_SORL_SD19_OFF (19)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD1 */
#define IFX_PSI5_CH_SORL_SD1_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD1 */
#define IFX_PSI5_CH_SORL_SD1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD1 */
#define IFX_PSI5_CH_SORL_SD1_OFF (1)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD20 */
#define IFX_PSI5_CH_SORL_SD20_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD20 */
#define IFX_PSI5_CH_SORL_SD20_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD20 */
#define IFX_PSI5_CH_SORL_SD20_OFF (20)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD21 */
#define IFX_PSI5_CH_SORL_SD21_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD21 */
#define IFX_PSI5_CH_SORL_SD21_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD21 */
#define IFX_PSI5_CH_SORL_SD21_OFF (21)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD22 */
#define IFX_PSI5_CH_SORL_SD22_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD22 */
#define IFX_PSI5_CH_SORL_SD22_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD22 */
#define IFX_PSI5_CH_SORL_SD22_OFF (22)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD23 */
#define IFX_PSI5_CH_SORL_SD23_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD23 */
#define IFX_PSI5_CH_SORL_SD23_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD23 */
#define IFX_PSI5_CH_SORL_SD23_OFF (23)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD24 */
#define IFX_PSI5_CH_SORL_SD24_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD24 */
#define IFX_PSI5_CH_SORL_SD24_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD24 */
#define IFX_PSI5_CH_SORL_SD24_OFF (24)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD25 */
#define IFX_PSI5_CH_SORL_SD25_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD25 */
#define IFX_PSI5_CH_SORL_SD25_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD25 */
#define IFX_PSI5_CH_SORL_SD25_OFF (25)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD26 */
#define IFX_PSI5_CH_SORL_SD26_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD26 */
#define IFX_PSI5_CH_SORL_SD26_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD26 */
#define IFX_PSI5_CH_SORL_SD26_OFF (26)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD27 */
#define IFX_PSI5_CH_SORL_SD27_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD27 */
#define IFX_PSI5_CH_SORL_SD27_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD27 */
#define IFX_PSI5_CH_SORL_SD27_OFF (27)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD28 */
#define IFX_PSI5_CH_SORL_SD28_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD28 */
#define IFX_PSI5_CH_SORL_SD28_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD28 */
#define IFX_PSI5_CH_SORL_SD28_OFF (28)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD29 */
#define IFX_PSI5_CH_SORL_SD29_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD29 */
#define IFX_PSI5_CH_SORL_SD29_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD29 */
#define IFX_PSI5_CH_SORL_SD29_OFF (29)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD2 */
#define IFX_PSI5_CH_SORL_SD2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD2 */
#define IFX_PSI5_CH_SORL_SD2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD2 */
#define IFX_PSI5_CH_SORL_SD2_OFF (2)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD30 */
#define IFX_PSI5_CH_SORL_SD30_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD30 */
#define IFX_PSI5_CH_SORL_SD30_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD30 */
#define IFX_PSI5_CH_SORL_SD30_OFF (30)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD31 */
#define IFX_PSI5_CH_SORL_SD31_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CH_SORL_Bits.SD31 */
#define IFX_PSI5_CH_SORL_SD31_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CH_SORL_Bits.SD31 */
#define IFX_PSI5_CH_SORL_SD31_OFF (31)

/** \\brief  Length for Ifx_PSI5_CH_SORL_Bits.SD3 */
#define IFX_PSI5_CH_SORL_SD3_LEN (1)

