HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxPsi5_bf.h
/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI22 */
#define IFX_PSI5_NFICLR_NFI22_OFF (22)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI23 */
#define IFX_PSI5_NFICLR_NFI23_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI23 */
#define IFX_PSI5_NFICLR_NFI23_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI23 */
#define IFX_PSI5_NFICLR_NFI23_OFF (23)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI24 */
#define IFX_PSI5_NFICLR_NFI24_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI24 */
#define IFX_PSI5_NFICLR_NFI24_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI24 */
#define IFX_PSI5_NFICLR_NFI24_OFF (24)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI25 */
#define IFX_PSI5_NFICLR_NFI25_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI25 */
#define IFX_PSI5_NFICLR_NFI25_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI25 */
#define IFX_PSI5_NFICLR_NFI25_OFF (25)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI26 */
#define IFX_PSI5_NFICLR_NFI26_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI26 */
#define IFX_PSI5_NFICLR_NFI26_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI26 */
#define IFX_PSI5_NFICLR_NFI26_OFF (26)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI27 */
#define IFX_PSI5_NFICLR_NFI27_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI27 */
#define IFX_PSI5_NFICLR_NFI27_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI27 */
#define IFX_PSI5_NFICLR_NFI27_OFF (27)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI28 */
#define IFX_PSI5_NFICLR_NFI28_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI28 */
#define IFX_PSI5_NFICLR_NFI28_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI28 */
#define IFX_PSI5_NFICLR_NFI28_OFF (28)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI29 */
#define IFX_PSI5_NFICLR_NFI29_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI29 */
#define IFX_PSI5_NFICLR_NFI29_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI29 */
#define IFX_PSI5_NFICLR_NFI29_OFF (29)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI2 */
#define IFX_PSI5_NFICLR_NFI2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI2 */
#define IFX_PSI5_NFICLR_NFI2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI2 */
#define IFX_PSI5_NFICLR_NFI2_OFF (2)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI30 */
#define IFX_PSI5_NFICLR_NFI30_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI30 */
#define IFX_PSI5_NFICLR_NFI30_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI30 */
#define IFX_PSI5_NFICLR_NFI30_OFF (30)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI31 */
#define IFX_PSI5_NFICLR_NFI31_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI31 */
#define IFX_PSI5_NFICLR_NFI31_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI31 */
#define IFX_PSI5_NFICLR_NFI31_OFF (31)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI3 */
#define IFX_PSI5_NFICLR_NFI3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI3 */
#define IFX_PSI5_NFICLR_NFI3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI3 */
#define IFX_PSI5_NFICLR_NFI3_OFF (3)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI4 */
#define IFX_PSI5_NFICLR_NFI4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI4 */
#define IFX_PSI5_NFICLR_NFI4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI4 */
#define IFX_PSI5_NFICLR_NFI4_OFF (4)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI5 */
#define IFX_PSI5_NFICLR_NFI5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI5 */
#define IFX_PSI5_NFICLR_NFI5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI5 */
#define IFX_PSI5_NFICLR_NFI5_OFF (5)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI6 */
#define IFX_PSI5_NFICLR_NFI6_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI6 */
#define IFX_PSI5_NFICLR_NFI6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI6 */
#define IFX_PSI5_NFICLR_NFI6_OFF (6)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI7 */
#define IFX_PSI5_NFICLR_NFI7_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI7 */
#define IFX_PSI5_NFICLR_NFI7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI7 */
#define IFX_PSI5_NFICLR_NFI7_OFF (7)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI8 */
#define IFX_PSI5_NFICLR_NFI8_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI8 */
#define IFX_PSI5_NFICLR_NFI8_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI8 */
#define IFX_PSI5_NFICLR_NFI8_OFF (8)

/** \\brief  Length for Ifx_PSI5_NFICLR_Bits.NFI9 */
#define IFX_PSI5_NFICLR_NFI9_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFICLR_Bits.NFI9 */
#define IFX_PSI5_NFICLR_NFI9_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFICLR_Bits.NFI9 */
#define IFX_PSI5_NFICLR_NFI9_OFF (9)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI0 */
#define IFX_PSI5_NFIOV_NFI0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI0 */
#define IFX_PSI5_NFIOV_NFI0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI0 */
#define IFX_PSI5_NFIOV_NFI0_OFF (0)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI10 */
#define IFX_PSI5_NFIOV_NFI10_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI10 */
#define IFX_PSI5_NFIOV_NFI10_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI10 */
#define IFX_PSI5_NFIOV_NFI10_OFF (10)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI11 */
#define IFX_PSI5_NFIOV_NFI11_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI11 */
#define IFX_PSI5_NFIOV_NFI11_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI11 */
#define IFX_PSI5_NFIOV_NFI11_OFF (11)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI12 */
#define IFX_PSI5_NFIOV_NFI12_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI12 */
#define IFX_PSI5_NFIOV_NFI12_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI12 */
#define IFX_PSI5_NFIOV_NFI12_OFF (12)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI13 */
#define IFX_PSI5_NFIOV_NFI13_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI13 */
#define IFX_PSI5_NFIOV_NFI13_MSK (0x1)

