HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxPsi5_bf.h
/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI27 */
#define IFX_PSI5_RDIOV_RDI27_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI27 */
#define IFX_PSI5_RDIOV_RDI27_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI27 */
#define IFX_PSI5_RDIOV_RDI27_OFF (27)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI28 */
#define IFX_PSI5_RDIOV_RDI28_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI28 */
#define IFX_PSI5_RDIOV_RDI28_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI28 */
#define IFX_PSI5_RDIOV_RDI28_OFF (28)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI29 */
#define IFX_PSI5_RDIOV_RDI29_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI29 */
#define IFX_PSI5_RDIOV_RDI29_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI29 */
#define IFX_PSI5_RDIOV_RDI29_OFF (29)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI2 */
#define IFX_PSI5_RDIOV_RDI2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI2 */
#define IFX_PSI5_RDIOV_RDI2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI2 */
#define IFX_PSI5_RDIOV_RDI2_OFF (2)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI30 */
#define IFX_PSI5_RDIOV_RDI30_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI30 */
#define IFX_PSI5_RDIOV_RDI30_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI30 */
#define IFX_PSI5_RDIOV_RDI30_OFF (30)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI31 */
#define IFX_PSI5_RDIOV_RDI31_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI31 */
#define IFX_PSI5_RDIOV_RDI31_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI31 */
#define IFX_PSI5_RDIOV_RDI31_OFF (31)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI3 */
#define IFX_PSI5_RDIOV_RDI3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI3 */
#define IFX_PSI5_RDIOV_RDI3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI3 */
#define IFX_PSI5_RDIOV_RDI3_OFF (3)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI4 */
#define IFX_PSI5_RDIOV_RDI4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI4 */
#define IFX_PSI5_RDIOV_RDI4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI4 */
#define IFX_PSI5_RDIOV_RDI4_OFF (4)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI5 */
#define IFX_PSI5_RDIOV_RDI5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI5 */
#define IFX_PSI5_RDIOV_RDI5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI5 */
#define IFX_PSI5_RDIOV_RDI5_OFF (5)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI6 */
#define IFX_PSI5_RDIOV_RDI6_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI6 */
#define IFX_PSI5_RDIOV_RDI6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI6 */
#define IFX_PSI5_RDIOV_RDI6_OFF (6)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI7 */
#define IFX_PSI5_RDIOV_RDI7_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI7 */
#define IFX_PSI5_RDIOV_RDI7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI7 */
#define IFX_PSI5_RDIOV_RDI7_OFF (7)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI8 */
#define IFX_PSI5_RDIOV_RDI8_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI8 */
#define IFX_PSI5_RDIOV_RDI8_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI8 */
#define IFX_PSI5_RDIOV_RDI8_OFF (8)

/** \\brief  Length for Ifx_PSI5_RDIOV_Bits.RDI9 */
#define IFX_PSI5_RDIOV_RDI9_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDIOV_Bits.RDI9 */
#define IFX_PSI5_RDIOV_RDI9_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDIOV_Bits.RDI9 */
#define IFX_PSI5_RDIOV_RDI9_OFF (9)

/** \\brief  Length for Ifx_PSI5_RDISET_Bits.RDI0 */
#define IFX_PSI5_RDISET_RDI0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDISET_Bits.RDI0 */
#define IFX_PSI5_RDISET_RDI0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDISET_Bits.RDI0 */
#define IFX_PSI5_RDISET_RDI0_OFF (0)

/** \\brief  Length for Ifx_PSI5_RDISET_Bits.RDI10 */
#define IFX_PSI5_RDISET_RDI10_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDISET_Bits.RDI10 */
#define IFX_PSI5_RDISET_RDI10_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDISET_Bits.RDI10 */
#define IFX_PSI5_RDISET_RDI10_OFF (10)

/** \\brief  Length for Ifx_PSI5_RDISET_Bits.RDI11 */
#define IFX_PSI5_RDISET_RDI11_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDISET_Bits.RDI11 */
#define IFX_PSI5_RDISET_RDI11_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDISET_Bits.RDI11 */
#define IFX_PSI5_RDISET_RDI11_OFF (11)

/** \\brief  Length for Ifx_PSI5_RDISET_Bits.RDI12 */
#define IFX_PSI5_RDISET_RDI12_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDISET_Bits.RDI12 */
#define IFX_PSI5_RDISET_RDI12_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDISET_Bits.RDI12 */
#define IFX_PSI5_RDISET_RDI12_OFF (12)

/** \\brief  Length for Ifx_PSI5_RDISET_Bits.RDI13 */
#define IFX_PSI5_RDISET_RDI13_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDISET_Bits.RDI13 */
#define IFX_PSI5_RDISET_RDI13_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDISET_Bits.RDI13 */
#define IFX_PSI5_RDISET_RDI13_OFF (13)

/** \\brief  Length for Ifx_PSI5_RDISET_Bits.RDI14 */
#define IFX_PSI5_RDISET_RDI14_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDISET_Bits.RDI14 */
#define IFX_PSI5_RDISET_RDI14_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDISET_Bits.RDI14 */
#define IFX_PSI5_RDISET_RDI14_OFF (14)

/** \\brief  Length for Ifx_PSI5_RDISET_Bits.RDI15 */
#define IFX_PSI5_RDISET_RDI15_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDISET_Bits.RDI15 */
#define IFX_PSI5_RDISET_RDI15_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDISET_Bits.RDI15 */
#define IFX_PSI5_RDISET_RDI15_OFF (15)

/** \\brief  Length for Ifx_PSI5_RDISET_Bits.RDI16 */
#define IFX_PSI5_RDISET_RDI16_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDISET_Bits.RDI16 */
#define IFX_PSI5_RDISET_RDI16_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDISET_Bits.RDI16 */
#define IFX_PSI5_RDISET_RDI16_OFF (16)

/** \\brief  Length for Ifx_PSI5_RDISET_Bits.RDI17 */
#define IFX_PSI5_RDISET_RDI17_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDISET_Bits.RDI17 */
#define IFX_PSI5_RDISET_RDI17_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDISET_Bits.RDI17 */
#define IFX_PSI5_RDISET_RDI17_OFF (17)

/** \\brief  Length for Ifx_PSI5_RDISET_Bits.RDI18 */
#define IFX_PSI5_RDISET_RDI18_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RDISET_Bits.RDI18 */
#define IFX_PSI5_RDISET_RDI18_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RDISET_Bits.RDI18 */
#define IFX_PSI5_RDISET_RDI18_OFF (18)

