HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxPsi5_bf.h
/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI30 */
#define IFX_PSI5_RSICLR_RSI30_OFF (30)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI31 */
#define IFX_PSI5_RSICLR_RSI31_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI31 */
#define IFX_PSI5_RSICLR_RSI31_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI31 */
#define IFX_PSI5_RSICLR_RSI31_OFF (31)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI3 */
#define IFX_PSI5_RSICLR_RSI3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI3 */
#define IFX_PSI5_RSICLR_RSI3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI3 */
#define IFX_PSI5_RSICLR_RSI3_OFF (3)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI4 */
#define IFX_PSI5_RSICLR_RSI4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI4 */
#define IFX_PSI5_RSICLR_RSI4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI4 */
#define IFX_PSI5_RSICLR_RSI4_OFF (4)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI5 */
#define IFX_PSI5_RSICLR_RSI5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI5 */
#define IFX_PSI5_RSICLR_RSI5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI5 */
#define IFX_PSI5_RSICLR_RSI5_OFF (5)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI6 */
#define IFX_PSI5_RSICLR_RSI6_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI6 */
#define IFX_PSI5_RSICLR_RSI6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI6 */
#define IFX_PSI5_RSICLR_RSI6_OFF (6)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI7 */
#define IFX_PSI5_RSICLR_RSI7_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI7 */
#define IFX_PSI5_RSICLR_RSI7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI7 */
#define IFX_PSI5_RSICLR_RSI7_OFF (7)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI8 */
#define IFX_PSI5_RSICLR_RSI8_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI8 */
#define IFX_PSI5_RSICLR_RSI8_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI8 */
#define IFX_PSI5_RSICLR_RSI8_OFF (8)

/** \\brief  Length for Ifx_PSI5_RSICLR_Bits.RSI9 */
#define IFX_PSI5_RSICLR_RSI9_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSICLR_Bits.RSI9 */
#define IFX_PSI5_RSICLR_RSI9_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSICLR_Bits.RSI9 */
#define IFX_PSI5_RSICLR_RSI9_OFF (9)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI0 */
#define IFX_PSI5_RSIOV_RSI0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI0 */
#define IFX_PSI5_RSIOV_RSI0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI0 */
#define IFX_PSI5_RSIOV_RSI0_OFF (0)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI10 */
#define IFX_PSI5_RSIOV_RSI10_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI10 */
#define IFX_PSI5_RSIOV_RSI10_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI10 */
#define IFX_PSI5_RSIOV_RSI10_OFF (10)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI11 */
#define IFX_PSI5_RSIOV_RSI11_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI11 */
#define IFX_PSI5_RSIOV_RSI11_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI11 */
#define IFX_PSI5_RSIOV_RSI11_OFF (11)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI12 */
#define IFX_PSI5_RSIOV_RSI12_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI12 */
#define IFX_PSI5_RSIOV_RSI12_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI12 */
#define IFX_PSI5_RSIOV_RSI12_OFF (12)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI13 */
#define IFX_PSI5_RSIOV_RSI13_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI13 */
#define IFX_PSI5_RSIOV_RSI13_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI13 */
#define IFX_PSI5_RSIOV_RSI13_OFF (13)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI14 */
#define IFX_PSI5_RSIOV_RSI14_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI14 */
#define IFX_PSI5_RSIOV_RSI14_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI14 */
#define IFX_PSI5_RSIOV_RSI14_OFF (14)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI15 */
#define IFX_PSI5_RSIOV_RSI15_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI15 */
#define IFX_PSI5_RSIOV_RSI15_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI15 */
#define IFX_PSI5_RSIOV_RSI15_OFF (15)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI16 */
#define IFX_PSI5_RSIOV_RSI16_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI16 */
#define IFX_PSI5_RSIOV_RSI16_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI16 */
#define IFX_PSI5_RSIOV_RSI16_OFF (16)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI17 */
#define IFX_PSI5_RSIOV_RSI17_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI17 */
#define IFX_PSI5_RSIOV_RSI17_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI17 */
#define IFX_PSI5_RSIOV_RSI17_OFF (17)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI18 */
#define IFX_PSI5_RSIOV_RSI18_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI18 */
#define IFX_PSI5_RSIOV_RSI18_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI18 */
#define IFX_PSI5_RSIOV_RSI18_OFF (18)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI19 */
#define IFX_PSI5_RSIOV_RSI19_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI19 */
#define IFX_PSI5_RSIOV_RSI19_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI19 */
#define IFX_PSI5_RSIOV_RSI19_OFF (19)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI1 */
#define IFX_PSI5_RSIOV_RSI1_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI1 */
#define IFX_PSI5_RSIOV_RSI1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI1 */
#define IFX_PSI5_RSIOV_RSI1_OFF (1)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI20 */
#define IFX_PSI5_RSIOV_RSI20_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI20 */
#define IFX_PSI5_RSIOV_RSI20_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_RSIOV_Bits.RSI20 */
#define IFX_PSI5_RSIOV_RSI20_OFF (20)

/** \\brief  Length for Ifx_PSI5_RSIOV_Bits.RSI21 */
#define IFX_PSI5_RSIOV_RSI21_LEN (1)

/** \\brief  Mask for Ifx_PSI5_RSIOV_Bits.RSI21 */
#define IFX_PSI5_RSIOV_RSI21_MSK (0x1)

